cf_billing/InformationRegisters/энргЗначенияПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияПлощадей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоКомнат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПроживающих</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПрописанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПрописанных</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоСобственников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНомерПломбПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНомерПломбПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПломбы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицоУстановившееПломбу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыПломб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСРабочимМестомОператора/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаполнитьДанныеТочекУчета(ПоляАбонента, Знач ДеревоТочек, Знач ДеревоДанныхПоПУ, Знач ДеревоДанныхПоУслугам, Знач ТочкиУчета, Знач ШкалыПриборовУчета, Знач ПоказанияПриборовУчета)	Экспорт 
	Период = ПоляАбонента.ТекущаяДата;		
	РезультатПакеты = ДействующиеТочкиИИхПриборы(Период, ПоляАбонента);
	ОбщееКолво = РезультатПакеты.Количество();
	
	РезультатЗапроса = РезультатПакеты[ОбщееКолво-1];
	ПолучитьПоказанияПриборУчета(ПоляАбонента, РезультатЗапроса, ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета);
	
	ТаблицаПломб = РезультатПакеты[ОбщееКолво-2].Выгрузить();	
	
	СписокДеревьев = Новый Структура("ДеревоТочек, ДеревоДанныхПоПУ, ЕстьОРП", ДеревоТочек, ДеревоДанныхПоПУ, Ложь);
	ЗаполнитьДеревьяТочекИПриборовУчета(РезультатЗапроса, ТаблицаПломб, СписокДеревьев, ПоказанияПриборовУчета);
	
	РезультатЗапроса = РезультатПакеты[ОбщееКолво-4];
	ЗаполнитьДеревоДанныхПоУслугам(РезультатЗапроса, ДеревоДанныхПоУслугам);	
		
	Возврат Новый Структура("ДеревоТочек, ДеревоДанныхПоПУ, ДеревоДанныхПоУслугам, ЕстьОРП", ДеревоТочек, ДеревоДанныхПоПУ, ДеревоДанныхПоУслугам, СписокДеревьев.ЕстьОРП);
	
КонецФункции 

Функция РезультатЗапросаДанныеПомещения(Период, Организация, Район, КлючПомещения, Абонент) Экспорт
	
	СхемаЗапроса	= Неопределено;
	ПараметрыОтбора	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация", "Организация"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район", "Район"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения", "КлючПомещения"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Абонент", "Абонент"))); 
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	#Область ЗначенияПлощадей
	РегистрыСведений.энргЗначенияПлощадей.ЗначенияПлощадейПомещений(СхемаЗапроса, ПараметрыОтбора, "ЗначенияПлощадейПомещений");
	#КонецОбласти
	
	#Область КоличествоКомнат
	РегистрыСведений.энргКоличествоКомнат.ТекстСрезПоследних(СхемаЗапроса, ПараметрыОтбора, "КоличествоКомнат");
	#КонецОбласти
	
	#Область КоличествоПроживающих
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(СхемаЗапроса, ПараметрыОтбора, "КоличествоПроживающихПомещения");
	#КонецОбласти
	
	#Область КоличествоПрописанных
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(СхемаЗапроса, ПараметрыОтбора, "КоличествоПрописанныхПомещения");
	#КонецОбласти 	
	
	#Область КоличествоСобственников
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(СхемаЗапроса, ПараметрыОтбора, "КоличествоСобственниковПомещения");
	#КонецОбласти
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	КоличествоКомнат.КлючПомещения КАК КлючПомещения,
	|	КоличествоКомнат.Количество КАК КоличествоКомнат,
	|	0 КАК КоличествоПрописанных,
	|	0 КАК КоличествоПроживающих,
	|	0 КАК КоличествоСобственников
	|ПОМЕСТИТЬ ОбъединенныеДанные
	|ИЗ
	|	КоличествоКомнат КАК КоличествоКомнат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КоличествоПрописанныхПомещения.КлючПомещения,
	|	0,
	|	КоличествоПрописанныхПомещения.Количество,
	|	0,
	|	0
	|ИЗ
	|	КоличествоПрописанныхПомещения КАК КоличествоПрописанныхПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КоличествоПроживающихПомещения.КлючПомещения,
	|	0,
	|	0,
	|	КоличествоПроживающихПомещения.Количество,
	|	0
	|ИЗ
	|	КоличествоПроживающихПомещения КАК КоличествоПроживающихПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КоличествоСобственниковПомещения.КлючПомещения,
	|	0,
	|	0,
	|	0,
	|	КоличествоСобственниковПомещения.Количество
	|ИЗ
	|	КоличествоСобственниковПомещения КАК КоличествоСобственниковПомещения");
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ОбъединенныеДанные.КлючПомещения КАК КлючПомещения,
	|	МАКСИМУМ(ОбъединенныеДанные.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(ОбъединенныеДанные.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(ОбъединенныеДанные.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(ОбъединенныеДанные.КоличествоСобственников) КАК КоличествоСобственников
	|ИЗ
	|	ОбъединенныеДанные КАК ОбъединенныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединенныеДанные.КлючПомещения");
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ЗначенияПлощадейПомещений.ВидПлощади КАК ВидПлощади,
	|	ЗначенияПлощадейПомещений.Площадь КАК Значение
	|ИЗ
	|	ЗначенияПлощадейПомещений КАК ЗначенияПлощадейПомещений");
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Организация"		, Организация);		
	ПараметрыЗапроса.Вставить("Район"			, Район);		
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);		
	ПараметрыЗапроса.Вставить("Абонент"			, Абонент);		
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьПакет(СхемаЗапроса, ПараметрыЗапроса);
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьДанныеОЛьготеАбонента(ПоляАбонента) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеОЛьготниках", Неопределено);
	
	РезультатЗапроса = ДанныеЛьготыАбонента(ПоляАбонента);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОписаниеСостояния = Новый Структура("СостояниеЛьготника, ДатаСостоянияЛьготника", Выборка.Состояние, Выборка.Период);	
	Результат.ДанныеОЛьготниках = ОписаниеСостояния;
	
	Возврат Результат;
	
КонецФункции  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСВкладкойДанныеТочекУчета


#Область РаботаСДеревомТочекУчета

Процедура ЗаполнитьДеревьяТочекИПриборовУчета(РезультатЗапроса, ТаблицаПломб, СписокДеревьев, ПоказанияПриборовУчета)
	
	ТаблицаТочек = РезультатЗапроса.Выгрузить();	
	КоллекцияДанныхТУ = СписокДеревьев.ДеревоТочек.Строки;
	КоллекцияДанныхПУ = СписокДеревьев.ДеревоДанныхПоПУ.Строки;
	
	ПриборЗаполнен 	 = Ложь;
	ТекТочкаУчета 	 = Неопределено;
	ТекШкала 		 = Неопределено;
	СтрокаДереваПУ   = Неопределено; 	
	СтрокаДанныхШкал = Неопределено;
	
	ВспомогательныеПараметрыТУ = Новый Структура("СостояниеОРП, ТекстОРП, ЕстьОРП", Перечисления.энргСостояниеТочекУчета.ОРП, "ВведеноОРП", СписокДеревьев.ЕстьОРП);
	ОтборСтрокПломб		= Новый Структура("ПриборУчета");
	ОтборСтрокПоказаний = Новый Структура("ПриборУчета,Шкала,ТарифнаяЗона");	
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() цикл
	
		
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			
			Если НЕ ЗначениеЗаполнено(Выборка.РодительТочкиУчета) Тогда				
				ДобавитьСтрокуТочкиУчета(Выборка, ТаблицаТочек, КоллекцияДанныхТУ, ВспомогательныеПараметрыТУ);
				СписокДеревьев.ЕстьОРП = ВспомогательныеПараметрыТУ.ЕстьОРП;
			КонецЕсли;
			
			ПриборЗаполнен = ЗначениеЗаполнено(Выборка.ПриборУчета);
			
			Если ПриборЗаполнен Тогда				
				СтрокаДереваПУ = КоллекцияДанныхПУ.Добавить();
				ДобавитьСтрокуПрибораУчета(Выборка, СтрокаДереваПУ);
				
				ДополнитьПломбыПрибораУчета(Выборка, СтрокаДереваПУ, ТаблицаПломб, ОтборСтрокПломб);							
				
				УровеньДанныхШкал 				= СтрокаДереваПУ.Строки;
				СтрокаДанныхПоказаний  			= УровеньДанныхШкал.Добавить();
				СтрокаДанныхПоказаний.Значение1 = "Данные показаний";
				
			КонецЕсли;
			
		КонецЕсли; 		
		
		Если ПриборЗаполнен Тогда 
			
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ НЕ ТекШкала = Выборка.Шкала Тогда				
				НоваяСтрокаШкалы = ДобавитьСтрокуШкалыПрибораУчета(Выборка, СтрокаДанныхПоказаний);				
			КонецЕсли;
			
			ДобавитьСтрокуТарифнойЗоныПрибораУчета(Выборка, НоваяСтрокаШкалы, ПоказанияПриборовУчета, ОтборСтрокПоказаний);
			
		КонецЕсли;	
		
		ТекТочкаУчета 	= Выборка.ТочкаУчета;
		ТекШкала 		= Выборка.Шкала;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуТочкиУчета(Выборка, ТаблицаТочек, КоллекцияЭлементовДерева, ВспомогательныеПараметрыТУ)
	
	ЭлементДерева = КоллекцияЭлементовДерева.Добавить();	
	ЗаполнитьЗначенияСвойств(ЭлементДерева, Выборка);
	
	Если ВспомогательныеПараметрыТУ.СостояниеОРП = Выборка.СостояниеТочкиУчета Тогда 
		ЭлементДерева.СлужебноеПоле = ВспомогательныеПараметрыТУ.ТекстОРП;
		ВспомогательныеПараметрыТУ.ЕстьОРП = Истина; 
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("РодительТочкиУчета", Выборка.ТочкаУчета);
	ПодчиненныеТочки = ТаблицаТочек.НайтиСтроки(ОтборСтрок);
	Для Каждого Строка Из ПодчиненныеТочки Цикл		
		ДобавитьСтрокуТочкиУчета(Строка, ТаблицаТочек, ЭлементДерева.Строки, ВспомогательныеПараметрыТУ);		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревомПриборовУчета

Процедура ДобавитьСтрокуПрибораУчета(Выборка, УровеньПрибораУчета) 	
	
	УровеньПрибораУчета.ПриборУчета = Выборка.ПриборУчета;
	
	УровеньОбщихДанных = УровеньПрибораУчета.Строки;
	СтрокаОбщихДанных = УровеньОбщихДанных.Добавить();
	СтрокаОбщихДанных.Значение1 = "Общие данные";
	
	УровеньДанныхПрибора = СтрокаОбщихДанных.Строки;
	ДобавитьОбщиеДанныеПрибораУчета(УровеньДанныхПрибора, Выборка); 		
		
КонецПроцедуры

Процедура ДобавитьОбщиеДанныеПрибораУчета(УровеньДанныхПрибора, Выборка)
	
	ДобавитьЗаводскойНомер(УровеньДанныхПрибора, Выборка);
	ДобавитьТипПрибораУчета(УровеньДанныхПрибора, Выборка);
	ДобавитьДатаПоверки(УровеньДанныхПрибора, Выборка);
	ДобавитьРегистрируетОбъем(УровеньДанныхПрибора, Выборка);  	
	
КонецПроцедуры

Процедура ДобавитьЗаводскойНомер(УровеньДанныхПрибора, Выборка)
	
	НоваяСтрока = УровеньДанныхПрибора.Добавить();
	НоваяСтрока.Значение1 = "Заводской номер";
	НоваяСтрока.Значение2 = Выборка.ЗаводскойНомер;
	
КонецПроцедуры

Процедура ДобавитьТипПрибораУчета(УровеньДанныхПрибора, Выборка)
	
	НоваяСтрока = УровеньДанныхПрибора.Добавить();
	НоваяСтрока.Значение1 = "Тип прибора учета";
	НоваяСтрока.Значение2 = Выборка.ТипПрибораУчета;
	
КонецПроцедуры

Процедура ДобавитьДатаПоверки(УровеньДанныхПрибора, Выборка)
	
	НоваяСтрока = УровеньДанныхПрибора.Добавить();
	НоваяСтрока.Значение1 = "Дата поверки счетчика";
	НоваяСтрока.Значение2 = Формат(Выборка.ДатаПоверки, "ДФ=dd.MM.yyyy");
	НоваяСтрока.Значение3 = ПолучитьСтатусНеобходимостиПоверки(Выборка);
	
КонецПроцедуры

Процедура ДобавитьРегистрируетОбъем(УровеньДанныхПрибора, Выборка)
	
	НоваяСтрока = УровеньДанныхПрибора.Добавить();
	НоваяСтрока.Значение1 = "Регистриует объем";
	НоваяСтрока.Значение2 = Выборка.РегистрируетОбъем;
	
КонецПроцедуры


Функция ДобавитьСтрокуШкалыПрибораУчета(Выборка, НачальныйУровень)
	
	УровеньДеталей = НачальныйУровень.Строки;
	НоваяСтрока = УровеньДеталей.Добавить();
	НоваяСтрока.Значение1 = Выборка.Шкала;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти

#Область РаботаСПоказаниямиПриборовУчета

Процедура ПолучитьПоказанияПриборУчета(ПоляАбонента, Результат, ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета)
	
	Период 				= ПоляАбонента.ТекущаяДата;
	Организация 		= ПоляАбонента.Организация;
	Район 				= ПоляАбонента.Район;
	КлючПомещения 		= ПоляАбонента.КлючПомещения;	
	
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	НомерСтроки  									= 1;
	НомерСтрокиПоФормуле 							= 0;
	Пока Выборка.Следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда  			
			СтрокаТочкиУчета  								= ТочкиУчета.Добавить();
			IDСтрокиТочки 									= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 						= IDСтрокиТочки;
			СтрокаТочкиУчета.ТочкаУчета 					= Выборка.ТочкаУчета;			
			СтрокаТочкиУчета.Услуга 						= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 					= Выборка.ПриборУчета;
			СтрокаТочкиУчета.НаправлениеИспользованияТУ 	= Выборка.НаправлениеИспользованияТУ;
			СтрокаТочкиУчета.РасчетПоФормуле 				= Выборка.РасчетПоФормуле;			
			СтрокаТочкиУчета.НомерПломбы					= Выборка.НомерПломбы;
			СтрокаТочкиУчета.ДатаПоверки  					= Выборка.ДатаПоверки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.НомерСтроки 			= НомерСтроки;
			НомерСтроки 							= НомерСтроки + 1;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 		= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Организация, ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, Район, КлючПомещения); 
	РезультатДанныеЗаполненияПоказаний 	= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Организация, Район, ТаблицаПоказанийДляЗаполнения, Период);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ПоказанияПриборовУчета);	
		
КонецПроцедуры

Процедура ДобавитьСтрокуТарифнойЗоныПрибораУчета(Выборка, НачальныйУровень, ПоказанияПриборовУчета, ОтборСтрокПоказаний)
	
	ОтборСтрокПоказаний.ПриборУчета = Выборка.ПриборУчета;
	ОтборСтрокПоказаний.Шкала = Выборка.Шкала;
	ОтборСтрокПоказаний.ТарифнаяЗона = Выборка.ТарифнаяЗона; 			
	ДанныеПоказаний = ПоказанияПриборовУчета.НайтиСтроки(ОтборСтрокПоказаний);
	
	Если ДанныеПоказаний.Количество() > 0 Тогда 
		СтрокаПредыдущихПоказаний = ДанныеПоказаний[0];
	Иначе 
		СтрокаПредыдущихПоказаний = Новый Структура("ПредыдущиеПоказания, ДатаПоследнихПоказаний", 0, "");
	КонецЕсли;
		
	УровеньШкал = НачальныйУровень.Строки;
	НоваяСтрокаТарифнойЗоны = УровеньШкал.Добавить();
	НоваяСтрокаТарифнойЗоны.Значение1 = Выборка.ТарифнаяЗона;
	
	УровеньТарифнойЗоны = НоваяСтрокаТарифнойЗоны.Строки;
	НоваяСтрока = УровеньТарифнойЗоны.Добавить();
	НоваяСтрока.Значение1 = "Последние показания";
	НоваяСтрока.Значение2 = Формат(СтрокаПредыдущихПоказаний.ПредыдущиеПоказания, "ЧДЦ=6"); 
	
	НоваяСтрока = УровеньТарифнойЗоны.Добавить();
	НоваяСтрока.Значение1 = "Дата последних показаний";
	НоваяСтрока.Значение2 = СтрокаПредыдущихПоказаний.ДатаПоследнихПоказаний;	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревомДанныхПоУслугам

Процедура ЗаполнитьДеревоДанныхПоУслугам(РезультатЗапроса, ДеревоДанныхПоУслугам)
	
	КоллекцияСтрокВерхнегоУровня = ДеревоДанныхПоУслугам.Строки;

	СтрокаТочкиУчета 	= Неопределено;
	ТекТочкаУчета 		= Неопределено;
	ТекУслуга 			= Неопределено;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() цикл
		
		НоваяТочка = НЕ ТекТочкаУчета = Выборка.ТочкаУчета;
		Если НоваяТочка Тогда 
			СтрокаТочкиУчета = КоллекцияСтрокВерхнегоУровня.Добавить();
			СтрокаТочкиУчета.ТочкаУчета = Выборка.ТочкаУчета;
		КонецЕсли;		
		
		Если НоваяТочка или НЕ ТекУслуга = Выборка.Услуга Тогда 
			
			КоллекцияПодчиненныхСтрокТУ = СтрокаТочкиУчета.Строки;
			УровеньУслуги = КоллекцияПодчиненныхСтрокТУ.Добавить();
			УровеньУслуги.Услуга = Выборка.Услуга;
			
			КоллекцияСтрокУслуги = УровеньУслуги.Строки;
			СтрокаДетализации = КоллекцияСтрокУслуги.Добавить();
			СтрокаДетализации.Услуга = "Поставщик";
			СтрокаДетализации.Значение1 = Выборка.Поставщик;
			
			СтрокаДетализации = КоллекцияСтрокУслуги.Добавить();
			СтрокаДетализации.Услуга = "Вид благоустройства";
			СтрокаДетализации.Значение1 = Выборка.ВидБлагоустройства;			
			
			СтрокаДетализации = КоллекцияСтрокУслуги.Добавить();
			СтрокаДетализации.Услуга = "Тарифная категория";
			СтрокаДетализации.Значение1 = Выборка.ГруппаПотребителей;
			
			СтрокаДетализации = КоллекцияСтрокУслуги.Добавить();
			СтрокаДетализации.Услуга = "Норма потребления";
			СтрокаДетализации.Значение1 = Формат(Выборка.ЗначениеНорматива, "ЧДЦ=6");
			
			// Значения тарифов
			СтрокаГруппыЗначениеТарифа = КоллекцияСтрокУслуги.Добавить();
			СтрокаГруппыЗначениеТарифа.Услуга = "Значение тарифа";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда			
			КоллекцияПодчиненныхСтрокЗначениеТарифа = СтрокаГруппыЗначениеТарифа.Строки;
			СтрокаДетализации = КоллекцияПодчиненныхСтрокЗначениеТарифа.Добавить();
			СтрокаДетализации.Услуга 	= Выборка.ТарифнаяЗона;
			СтрокаДетализации.Значение1 = Выборка.ЗначениеТарифа;
		КонецЕсли;		
		
		ТекТочкаУчета = Выборка.ТочкаУчета;
		ТекУслуга = Выборка.Услуга;
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСПломбамиПриборвУчета

Процедура ДополнитьПломбыПрибораУчета(Выборка, СтрокаДереваПУ, ТаблицаПломб, ОтборСтрокПломб)
	
	ОтборСтрокПломб.ПриборУчета = Выборка.ПриборУчета; 
	СтрокиПломб 				= ТаблицаПломб.НайтиСтроки(ОтборСтрокПломб);
	
	Если СтрокиПломб.Количество() > 0 Тогда
		
		КоллекцияВложенностиПУ = СтрокаДереваПУ.Строки;
		УровеньДанныхПломб = КоллекцияВложенностиПУ.Добавить();
		УровеньДанныхПломб.Значение1 = "Данные пломб"; 				
		
		Для Каждого Строка Из СтрокиПломб Цикл		
			ДобавитьСтрокуПломбы(Строка, УровеньДанныхПломб);		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуПломбы(Выборка, НачальныйУровень)
	
	УровеньТарифнойЗоны = НачальныйУровень.Строки;
	НоваяСтрока = УровеньТарифнойЗоны.Добавить();
	НоваяСтрока.Значение1 = "Место установки пломбы";
	НоваяСтрока.Значение2 = Выборка.МестоУстановки;
	
	НоваяСтрока = УровеньТарифнойЗоны.Добавить();
	НоваяСтрока.Значение1 = "Дата установки пломбы";
	НоваяСтрока.Значение2 = Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
	
	НоваяСтрока = УровеньТарифнойЗоны.Добавить();
	НоваяСтрока.Значение1 = "Номер пломбы";
	НоваяСтрока.Значение2 = Выборка.НомерПломбы;
	
КонецПроцедуры
	
#КонецОбласти


#Область ПолучениеДанных

Функция ДействующиеТочкиИИхПриборы(Период, ПоляАбонента) 
	
	Схема		= Неопределено;
	Параметры	= Новый Структура;
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("АбонентВладелец"	, "КлючПомещения")	, Неопределено));
		
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Параметры.Вставить("ВключаяОРП"	, Истина);
	
	ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	ЗаполнитьСхемуДополнительныеДанныеУслуг(Схема, Параметры);
	
	// Пломбы исключены т.к их может быть несколько на прибор
	РегистрыСведений.энргНомерПломбПриборовУчета.НомераПломбВведенныхПриборовДействующихТочек(Схема, Параметры, "");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК ТекущаяДата,
		|	ДанныеПоПриборамИтог.Организация КАК Организация,
		|	ДанныеПоПриборамИтог.Район КАК Район,
		|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
		|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПоПриборамИтог.СостояниеТочкиУчета КАК СостояниеТочкиУчета,
		|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
		|	ДанныеПоПриборамИтог.ЗаводскойНомер КАК ЗаводскойНомер,
		|	ДанныеПоПриборамИтог.ТипПрибораУчета КАК ТипПрибораУчета,
		|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
		|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
		|	ДанныеПоПриборамИтог.Техническая КАК Техническая,
		|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
		|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
		|   ДанныеПоПриборамИтог.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
		|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
		|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
		|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга,
		|	ДанныеПоПриборамИтог.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	ДанныеПоПриборамИтог.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|	ДанныеПоПриборамИтог.СтруктураСети КАК СтруктураСети,
		|	ДанныеПоПриборамИтог.Абонент КАК Абонент,
		|	ВЫБОР
		|		КОГДА ДанныеПоПриборамИтог.СостояниеТочкиУчета = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП)
		|			ТОГДА ДанныеПоПриборамИтог.ПериодСостоянияТУ
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодСостоянияТУ
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	РодительТочкиУчета,
		|	ТочкаУчета,
		|	Шкала");	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период",					Период);
	ПараметрыЗапроса.Вставить("МоментВремени",			Период);
	ПараметрыЗапроса.Вставить("ТипНачисления",			Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	ПараметрыЗапроса.Вставить("Район",					ПоляАбонента.Район);
	ПараметрыЗапроса.Вставить("Организация",			ПоляАбонента.Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",			ПоляАбонента.КлючПомещения);	
	ПараметрыЗапроса.Вставить("КоличествоКомнат",		ПоляАбонента.КоличествоКомнат);
	ПараметрыЗапроса.Вставить("КоличествоПроживающих",	ПоляАбонента.КоличествоПроживающих);
	ПараметрыЗапроса.Вставить("КоличествоПрописанных",	ПоляАбонента.КоличествоПрописанных);
	ПараметрыЗапроса.Вставить("КоличествоСобственников",ПоляАбонента.КоличествоСобственников);
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Возврат энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса, МВТ);
			
КонецФункции

Процедура ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры) 
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, Параметры, "ДействующиеПриборыУчетаПомещения");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема, Параметры, "УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, Параметры, "НаправлениеИспользованияДействующихТочек");
	РегистрыСведений.бестТУНаСтруктуреСети.СтруктураСетиТочкиУчета(Схема, Параметры, "АктуальнаяСтруктураСетиТочкиУчета");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема, Параметры, "ВидДифференцированностиВведенныхПриборов");
	РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема, Параметры, "ДействующиеТочкиТочкиПоФормуле");	
	РегистрыСведений.энргДатыПоверкиПрибораУчета.ДатыПоверокДействующихПриборовУчета(Схема, Параметры, "ДатыПоверкиВведенныхПриборовДействующихТочек");
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема, Параметры, "АктуальныеРодителиТочекУчета");
	РегистрыСведений.энргТехническаяВозможностьУстановкиПУ.ТехническаяВозможностьУстановкиПУТочекУчета(Схема, Параметры, "ТехническаяВозможностьУстановкиПУТочекУчета");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|	ВложенныйЗапрос.СостояниеТочкиУчета КАК СостояниеТочкиУчета,
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
		|	ЕСТЬNULL(энргВидыКанальностиШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
		|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
		|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета,
		|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|	ВложенныйЗапрос.СтруктураСети КАК СтруктураСети,
		|	энргТипыПриборовУчета.МаркаПУ КАК МаркаПУ,
		|	ВложенныйЗапрос.ПериодСостоянияТУ КАК ПериодСостоянияТУ
		|ПОМЕСТИТЬ ДанныеПоПриборам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.Район КАК Район,
		|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|		ВложенныйЗапрос.СостояниеТочкиУчета КАК СостояниеТочкиУчета,
		|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|		ВложенныйЗапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|		ЕСТЬNULL(энргПриборыУчетаАбонента.ВидКанальности, ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.ПустаяСсылка)) КАК ВидКанальности,
		|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
		|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомер,
		|		энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
		|		ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|		ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|		ВложенныйЗапрос.СтруктураСети КАК СтруктураСети,
		|		ВложенныйЗапрос.ПериодСостоянияТУ КАК ПериодСостоянияТУ
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ДействующиеТочки.Организация КАК Организация,
		|			ДействующиеТочки.Район КАК Район,
		|			ДействующиеТочки.КлючПомещения КАК КлючПомещения,
		|			ДействующиеТочки.ТочкаУчета КАК ТочкаУчета,
		|			ДействующиеТочки.Состояние КАК СостояниеТочкиУчета,
		|			ЕСТЬNULL(ДействующиеПриборыУчетаПомещения.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ПриборУчета,
		|			ЕСТЬNULL(АктуальныеРодителиТочекУчета.РодительТочкиУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК РодительТочкиУчета,
		|			ЕСТЬNULL(ТехническаяВозможностьУстановкиПУТочекУчета.НетВозможностьУстановкиПУ, ЛОЖЬ) КАК НетВозможностьУстановкиПУ,
		|			ЕСТЬNULL(ТехническаяВозможностьУстановкиПУТочекУчета.РасчетТолькоПоПоказаниям, ЛОЖЬ) КАК РасчетТолькоПоПоказаниям,
		|			АктуальнаяСтруктураСетиТочкиУчета.СтруктураСети КАК СтруктураСети,
		|			ДействующиеТочки.Период КАК ПериодСостоянияТУ
		|		ИЗ
		|			ДействующиеТочки КАК ДействующиеТочки
		|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения
		|				ПО ДействующиеТочки.Организация = ДействующиеПриборыУчетаПомещения.Организация
		|					И ДействующиеТочки.Район = ДействующиеПриборыУчетаПомещения.Район
		|					И ДействующиеТочки.КлючПомещения = ДействующиеПриборыУчетаПомещения.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = ДействующиеПриборыУчетаПомещения.ТочкаУчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеРодителиТочекУчета КАК АктуальныеРодителиТочекУчета
		|				ПО ДействующиеТочки.Организация = АктуальныеРодителиТочекУчета.Организация
		|					И ДействующиеТочки.Район = АктуальныеРодителиТочекУчета.Район
		|					И ДействующиеТочки.КлючПомещения = АктуальныеРодителиТочекУчета.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = АктуальныеРодителиТочекУчета.ТочкаУчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТехническаяВозможностьУстановкиПУТочекУчета КАК ТехническаяВозможностьУстановкиПУТочекУчета
		|				ПО ДействующиеТочки.Организация = ТехническаяВозможностьУстановкиПУТочекУчета.Организация
		|					И ДействующиеТочки.Район = ТехническаяВозможностьУстановкиПУТочекУчета.Район
		|					И ДействующиеТочки.КлючПомещения = ТехническаяВозможностьУстановкиПУТочекУчета.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = ТехническаяВозможностьУстановкиПУТочекУчета.ТочкаУчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ АктуальнаяСтруктураСетиТочкиУчета КАК АктуальнаяСтруктураСетиТочкиУчета
		|				ПО ДействующиеТочки.Организация = АктуальнаяСтруктураСетиТочкиУчета.Организация
		|					И ДействующиеТочки.Район = АктуальнаяСтруктураСетиТочкиУчета.Район
		|					И ДействующиеТочки.КлючПомещения = АктуальнаяСтруктураСетиТочкиУчета.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = АктуальнаяСтруктураСетиТочкиУчета.ТочкаУчета) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|			ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
		|		ПО ВложенныйЗапрос.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Вложенныйзапрос.Организация КАК Организация,
		|	Вложенныйзапрос.Район КАК Район,
		|	Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.СостояниеТочкиУчета КАК СостояниеТочкиУчета,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	Вложенныйзапрос.Услуга КАК Услуга,
		|	Вложенныйзапрос.Техническая КАК Техническая,
		|	Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
		|	Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
		|	Вложенныйзапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
		|	Вложенныйзапрос.ЗаводскойНомер КАК ЗаводскойНомер,
		|	Вложенныйзапрос.ТипПрибораУчета КАК ТипПрибораУчета,
		|	Вложенныйзапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	Вложенныйзапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
		|	"""" КАК НомерПломбы,
		|	ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ДатыПоверкиВведенныхПриборовДействующихТочек.ДатаПоверки, ДАТАВРЕМЯ(1, 1, 1)), ГОД, Вложенныйзапрос.МежповерочныйИнтервал) КАК ДатаПоверки,
		|	ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга,
		|	Вложенныйзапрос.СтруктураСети КАК СтруктураСети,
		|	АбонентыПомещений.Абонент КАК Абонент,
		|	Вложенныйзапрос.ПериодСостоянияТУ КАК ПериодСостоянияТУ
		|ПОМЕСТИТЬ ДанныеПоПриборамИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.Организация КАК Организация,
		|		ДанныеПоПриборам.Район КАК Район,
		|		ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.СостояниеТочкиУчета КАК СостояниеТочкиУчета,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.РодительТочкиУчета КАК РодительТочкиУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
		|		ЕСТЬNULL(УслугиДействующихТочек.Техническая, ЛОЖЬ) КАК Техническая,
		|		ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
		|		НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
		|		ДействующиеТочкиТочкиПоФормуле.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
		|		ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
		|		ДанныеПоПриборам.ЗаводскойНомер КАК ЗаводскойНомер,
		|		ДанныеПоПриборам.ТипПрибораУчета КАК ТипПрибораУчета,
		|		ДанныеПоПриборам.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|		ДанныеПоПриборам.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|		ДанныеПоПриборам.СтруктураСети КАК СтруктураСети,
		|		ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал, 0) КАК МежповерочныйИнтервал,
		|		ДанныеПоПриборам.ПериодСостоянияТУ КАК ПериодСостоянияТУ
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
		|			ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
		|				И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
		|				И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
		|			ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
		|				И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
		|				И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
		|			ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
		|				И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
		|				И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
		|			ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
		|				И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
		|				И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
		|				И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
		|			ПО ДанныеПоПриборам.МаркаПУ = энргМаркиПриборовУчета.Ссылка) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоверкиВведенныхПриборовДействующихТочек КАК ДатыПоверкиВведенныхПриборовДействующихТочек
		|		ПО Вложенныйзапрос.ПриборУчета = ДатыПоверкиВведенныхПриборовДействующихТочек.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
		|		ПО Вложенныйзапрос.Организация = АбонентыПомещений.Организация
		|			И Вложенныйзапрос.Район = АбонентыПомещений.Район
		|			И Вложенныйзапрос.КлючПомещения = АбонентыПомещений.КлючПомещения
		|			И Вложенныйзапрос.Услуга = АбонентыПомещений.Услуга");
КонецПроцедуры

Процедура ЗаполнитьСхемуДополнительныеДанныеУслуг(Схема, Параметры)
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	УслугиДействующихТочек.Организация КАК Организация,
		|	УслугиДействующихТочек.Район КАК Район,
		|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
		|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
		|	УслугиДействующихТочек.Услуга КАК Услуга,
		|	энргВидыУслуг.СоставнаяУслуга КАК СоставнаяУслуга
		|ПОМЕСТИТЬ ОбщиеДанныеУслуг
		|ИЗ
		|	УслугиДействующихТочек КАК УслугиДействующихТочек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО УслугиДействующихТочек.Услуга = энргВидыУслуг.Ссылка");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ОбщиеДанныеУслуг.Организация КАК Организация,
		|	ОбщиеДанныеУслуг.Район КАК Район,
		|	ОбщиеДанныеУслуг.КлючПомещения КАК КлючПомещения,
		|	ОбщиеДанныеУслуг.ТочкаУчета КАК ТочкаУчета,
		|	ОбщиеДанныеУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
		|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга,
		|	ИСТИНА КАК ЧастьСоставной
		|ПОМЕСТИТЬ ДетализацияУслуг
		|ИЗ
		|	ОбщиеДанныеУслуг КАК ОбщиеДанныеУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО ОбщиеДанныеУслуг.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|			И (ОбщиеДанныеУслуг.СоставнаяУслуга)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеДанныеУслуг.Организация,
		|	ОбщиеДанныеУслуг.Район,
		|	ОбщиеДанныеУслуг.КлючПомещения,
		|	ОбщиеДанныеУслуг.ТочкаУчета,
		|	ОбщиеДанныеУслуг.СоставнаяУслуга,
		|	ОбщиеДанныеУслуг.Услуга,
		|	ЛОЖЬ
		|ИЗ
		|	ОбщиеДанныеУслуг КАК ОбщиеДанныеУслуг
		|ГДЕ
		|	ОбщиеДанныеУслуг.СоставнаяУслуга = ЛОЖЬ");
	
	
	ПараметрыУслуг = ОбщегоНазначения.СкопироватьРекурсивно(Параметры);
	СоответствиеПолей = Новый Структура(
		"Организация,Район,КлючПомещения,ТочкаУчета,Услуга,ЧастьСоставной",
		"Организация", "Район", "КлючПомещения", "ТочкаУчета", "Услуга", "ЧастьСоставной");
	ОтборВТ = энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ДетализацияУслуг", СоответствиеПолей);
	ПараметрыУслуг.ПараметрыВТ.Добавить(ОтборВТ);
	
	РегистрыСведений.энргГруппыПотребителейАбонентов.ГруппыПотребителейАбонентов(Схема, ПараметрыУслуг, "ГруппыПотребителейАбонентов");
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугАбонента(Схема, ПараметрыУслуг, "ПоставщикиУслугАбонента");
	РегистрыСведений.энргВидБлагоустройствАбонента.АктуальныеВидыБлагоустройств(Схема, ПараметрыУслуг, "АктуальныеВидыБлагоустройств");
		
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ДетализацияУслуг.Организация КАК Организация,
		|	ДетализацияУслуг.Район КАК Район,
		|	ДетализацияУслуг.КлючПомещения КАК КлючПомещения,
		|	ДетализацияУслуг.ТочкаУчета КАК ТочкаУчета,
		|	ДетализацияУслуг.Услуга КАК Услуга,
		|	ДетализацияУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
		|	ГруппыПотребителейАбонентов.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ПоставщикиУслугАбонента.Поставщик КАК Поставщик,
		|	АктуальныеВидыБлагоустройств.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВспомогательныеДанныеУслуг
		|ИЗ
		|	ДетализацияУслуг КАК ДетализацияУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыПотребителейАбонентов КАК ГруппыПотребителейАбонентов
		|		ПО ДетализацияУслуг.Организация = ГруппыПотребителейАбонентов.Организация
		|			И ДетализацияУслуг.Район = ГруппыПотребителейАбонентов.Район
		|			И ДетализацияУслуг.КлючПомещения = ГруппыПотребителейАбонентов.КлючПомещения
		|			И ДетализацияУслуг.Услуга = ГруппыПотребителейАбонентов.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиУслугАбонента КАК ПоставщикиУслугАбонента
		|		ПО ДетализацияУслуг.Организация = ПоставщикиУслугАбонента.Организация
		|			И ДетализацияУслуг.Район = ПоставщикиУслугАбонента.Район
		|			И ДетализацияУслуг.КлючПомещения = ПоставщикиУслугАбонента.КлючПомещения
		|			И ДетализацияУслуг.ТочкаУчета = ПоставщикиУслугАбонента.ТочкаУчета
		|			И ДетализацияУслуг.Услуга = ПоставщикиУслугАбонента.Услуга
		|			И ДетализацияУслуг.ЧастьСоставной = ПоставщикиУслугАбонента.ЧастьСоставной
		|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеВидыБлагоустройств КАК АктуальныеВидыБлагоустройств
		|		ПО ДетализацияУслуг.Организация = АктуальныеВидыБлагоустройств.Организация
		|			И ДетализацияУслуг.Район = АктуальныеВидыБлагоустройств.Район
		|			И ДетализацияУслуг.КлючПомещения = АктуальныеВидыБлагоустройств.КлючПомещения
		|			И ДетализацияУслуг.Услуга = АктуальныеВидыБлагоустройств.Услуга");
	
	
	ЗаполнитьСхемуЗначениеНормативов(Схема, Параметры);
	
	ПараметрыЗначенияТарифов = ОбщегоНазначения.СкопироватьРекурсивно(Параметры);
	СоответствиеПолей = Новый Структура(
		"Организация,Район,ГруппаПотребителей,Услуга,Поставщик",
		"Организация", "Район", "ГруппаПотребителей", "Услуга", "Поставщик");
	ОтборВТ = энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ВспомогательныеДанныеУслуг", СоответствиеПолей);
	ПараметрыЗначенияТарифов.ПараметрыВТ.Добавить(ОтборВТ);
	РегистрыСведений.энргЗначенияТарифов.ЗначенияТарифов(Схема, ПараметрыЗначенияТарифов, "ЗначенияТарифов"); 
	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ВспомогательныеДанныеУслуг.Организация КАК Организация,
		|	ВспомогательныеДанныеУслуг.Район КАК Район,
		|	ВспомогательныеДанныеУслуг.КлючПомещения КАК КлючПомещения,
		|	ВспомогательныеДанныеУслуг.ТочкаУчета КАК ТочкаУчета,
		|	ВспомогательныеДанныеУслуг.Услуга КАК Услуга,
		|	ВспомогательныеДанныеУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
		|	ВспомогательныеДанныеУслуг.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ВспомогательныеДанныеУслуг.Поставщик КАК Поставщик,
		|	ВспомогательныеДанныеУслуг.ВидБлагоустройства КАК ВидБлагоустройства,
		|	ЗначенияТекущихНормПотребления.ЗначениеНорматива КАК ЗначениеНорматива,
		|	ЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ЗначенияТарифов.Значение КАК ЗначениеТарифа
		|ИЗ
		|	ВспомогательныеДанныеУслуг КАК ВспомогательныеДанныеУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
		|		ПО ВспомогательныеДанныеУслуг.Организация = ЗначенияТарифов.Организация
		|			И ВспомогательныеДанныеУслуг.Район = ЗначенияТарифов.Район
		|			И ВспомогательныеДанныеУслуг.ГруппаПотребителей = ЗначенияТарифов.ГруппаПотребителей
		|			И ВспомогательныеДанныеУслуг.Услуга = ЗначенияТарифов.Услуга
		|			И ВспомогательныеДанныеУслуг.Поставщик = ЗначенияТарифов.Поставщик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
		|		ПО ВспомогательныеДанныеУслуг.Организация = ЗначенияТекущихНормПотребления.Организация
		|			И ВспомогательныеДанныеУслуг.Район = ЗначенияТекущихНормПотребления.Район
		|			И ВспомогательныеДанныеУслуг.Услуга = ЗначенияТекущихНормПотребления.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТочкаУчета,
		|	Услуга");
	
КонецПроцедуры

Процедура ЗаполнитьСхемуЗначениеНормативов(Схема, Параметры) Экспорт 
	
	РегистрыСведений.энргТипСобственностиАбонентов.ТекстСрезПоследних(Схема, Параметры, "АктуальныйТипСобственности");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ВспомогательныеДанныеУслуг.Организация КАК Организация,
		|	ВспомогательныеДанныеУслуг.Район КАК Район,
		|	ВспомогательныеДанныеУслуг.КлючПомещения КАК КлючПомещения,
		|	ВспомогательныеДанныеУслуг.ТочкаУчета КАК ТочкаУчета,
		|	ВспомогательныеДанныеУслуг.Услуга КАК Услуга,
		|	НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ВспомогательныеДанныеУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
		|	ВспомогательныеДанныеУслуг.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ВспомогательныеДанныеУслуг.Поставщик КАК Поставщик,
		|	ВспомогательныеДанныеУслуг.ВидБлагоустройства КАК ВидБлагоустройства,
		|	энргКлючиПомещений.Строение КАК Строение,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	АктуальныйТипСобственности.ТипСобственности КАК ВидСобственности,
		|	0 КАК ГодПостройки,
		|	&КоличествоКомнат КАК КоличествоКомнат,
		|	&КоличествоПроживающих КАК КоличествоПроживающих,
		|	&КоличествоПрописанных КАК КоличествоПрописанных,
		|	&КоличествоСобственников КАК КоличествоСобственников,
		|	0 КАК КоличествоЭтажей
		|ПОМЕСТИТЬ ВсеПараметрыРасчета
		|ИЗ
		|	ВспомогательныеДанныеУслуг КАК ВспомогательныеДанныеУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО ВспомогательныеДанныеУслуг.КлючПомещения = энргКлючиПомещений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныйТипСобственности КАК АктуальныйТипСобственности
		|		ПО ВспомогательныеДанныеУслуг.Организация = АктуальныйТипСобственности.Организация
		|			И ВспомогательныеДанныеУслуг.Район = АктуальныйТипСобственности.Район
		|			И ВспомогательныеДанныеУслуг.КлючПомещения = АктуальныйТипСобственности.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
		|		ПО ВспомогательныеДанныеУслуг.Организация = НаправлениеИспользованияДействующихТочек.Организация
		|			И ВспомогательныеДанныеУслуг.Район = НаправлениеИспользованияДействующихТочек.Район
		|			И ВспомогательныеДанныеУслуг.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
		|			И ВспомогательныеДанныеУслуг.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета");
	
	
	
	Текст = Схема.ПолучитьТекстЗапроса();
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов();	
	Текст = Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива();	
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Текст  = Текст +
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива
	|ПОМЕСТИТЬ ВсеПараметрыРасчетаНорматив
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
	|		И КлючиНорматива.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)";
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Текст);	
	
	ПараметрыНормПотребления = ОбщегоНазначения.СкопироватьРекурсивно(Параметры);                                          	
	
	ПараметрыНормПотребления.ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("ТипНачисления", "ТипНачисления")));	
	СоответствиеПолей = Новый Структура(
		"НаправлениеИспользованияТУ,КлючНорматива,Услуга",
		"НаправлениеИспользованияТУ", "КлючНорматива", "Услуга");
	ОтборВТ = энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ВсеПараметрыРасчетаНорматив", СоответствиеПолей);
	ПараметрыНормПотребления.ПараметрыВТ.Добавить(ОтборВТ);	
	РегистрыСведений.энргЗначенияНормативовПотребления.ЗначенияТекущихНормПотребления(Схема, ПараметрыНормПотребления, "ЗначенияТекущихНормПотребления");
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область РаботаСЛьготниками

Функция ДанныеЛьготыАбонента(ПоляАбонента)
	
	СхемаЗапроса	= Неопределено;
	ПараметрыОтбора	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация", "Организация"))); 
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район", "Район"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Абонент", "Абонент"))); 
	
	Если ЗначениеЗаполнено(ПоляАбонента.ТекущаяДата) Тогда
		ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргЖильцыЛьготныхКатегорий.АктуальныеДанные(СхемаЗапроса, ПараметрыОтбора); 	
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, ПоляАбонента.ТекущаяДата);
	//ПараметрыЗапроса.Вставить("Организация"		, Организация);		
	//ПараметрыЗапроса.Вставить("Район"			, Район);		
	//ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);		
	ПараметрыЗапроса.Вставить("Абонент"			, ПоляАбонента.Абонент);		
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса);
	
	Возврат РезультатЗапроса;
	
КонецФункции
	
#КонецОбласти

#Область ВспомогательныеМетоды

Функция ПолучитьСтатусНеобходимостиПоверки(Выборка)
	
	Результат = "";
	
	Если Выборка.ДатаПоверки < Выборка.ТекущаяДата Тогда  		
		Результат = "ДатаПоверкиПрошла";  		
	ИначеЕсли РазницаДатВМесяцах(Выборка.ДатаПоверки, Выборка.ТекущаяДата) <= 2 Тогда 		
		Результат = "ДатаПоверкиПодходитКИстечению";		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазницаДатВМесяцах(Дата1, Дата2) 
	
	ДатаНач	= ?(Дата1 < Дата2, Дата1, Дата2);
	ДатаКон	= ?(Дата1 < Дата2, Дата2, Дата1);
	
	Годы    = Год( датаКон ) - Год( датаНач );
	Месяцы  = Месяц( датаКон ) - Месяц( датаНач );
	
	Разность = месяцы + годы * 12;
	
	Возврат Разность;
	
КонецФункции

#КонецОбласти

#КонецОбласти
